Revit 2027 API
PanelScheduleTemplate.GetSectionData Method
 Gets the writable section data object.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TableSectionData GetSectionData(
	SectionType sectionType
)
Public Function GetSectionData (
	sectionType As SectionType
) As TableSectionData
public:
TableSectionData^ GetSectionData(
	SectionType sectionType
)
member GetSectionData :
        sectionType : SectionType -> TableSectionData
Parameters
sectionType SectionType
Return Value
TableSectionData
 The table section data object.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 Access to this information requires an open transaction.
See Also
Reference
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace